#include <iostream>
#include <stdint.h>
using namespace std;

// Попробовал макрос
#define cpfl(param) static_cast<float>(param)
#define cpi(param) static_cast<int>(param)

/*
* Ex 4 */
extern const int a4, b4, c4, d4;
/**/

int main() {
	setlocale(LC_ALL, "Russian");
	/* 
	================================================================================================================================================
	* Написать программу, вычисляющую выражение a * (b + (c / d)) и выводящую результат с плавающей точкой, где 
	* a, b, c, d – целочисленные константы. Используйте static_cast или С-Style cast к float чтобы выполнить точное деление.
	================================================================================================================================================ 
	*/
	cout << "Задание 1" << endl;
	const int a = 2, b = 5, c = 13, d = 3;
	float e = a * (b + cpfl(c) / d);
	printf("float result = %f \n\n", e);
	/* 
	================================================================================================================================================
	* Дано целое число. Если оно меньше или равно 21, то выведите на экран разницу между этим числом и числом 21. 
	* Если же заданное число больше, чем 21, необходимо вывести удвоенную разницу между этим числом и 21. 
	* При выполнении задания следует использовать тернарный оператор (?:).
	================================================================================================================================================ 
	*/
	cout << "Задание 2" << endl;
	int input;
	cout << "Введите целое число: ";
    cin >> input;
	while (!cin) {
		cin.clear();
		cin.ignore(numeric_limits<streamsize>::max(), '\n');
		cout << "Введите !!!целое число!!!: ";
		cin >> input;
	}
	(input <= 21) ? (cout << "Ваше число меньше или равно 21. Вывожу " << 21 - input << endl) ://
					(cout << "Ваше число больше 21. Вывожу " << (input-21)*2 << endl << endl);
	/* 
	================================================================================================================================================
	* Описать трёхмерный целочисленный юмассив, размером 3х3х3 и указатель на значения внутри массива 
	* и при помощи операции разыменования вывести на экран значение центральной ячейки получившегося куба [1][1][1].
	================================================================================================================================================  
	*/ 
	cout << endl << "Задание 3" << endl;
	int cube[3][3][3];
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			for (int k = 0; k < 3; k++) {
				cube[i][j][k] = i * 9 + j * 3 + k + 1;
			}
		}
	}
	int* pti = &cube[1][1][1];
	cout << "Вывод как *(&cube[...) = "<< *pti << endl;
	cout << "Вывод1 как *(*(*cube+... = "<< *(*(*(cube + 1) + 1) + 1) << endl;
	cout << "Вывод2 как *(*(*cube)... = "<< *(*(*cube) + 13) << endl;
	/*
	================================================================================================================================================
	* Написать программу, вычисляющую выражение из первого задания, а переменные для неё объявить 
	* и инициализировать в другом cpp файле. Используйте extern
	================================================================================================================================================
	*/
	cout << endl << "Задание 4" << endl;
	float e4 = a4 * (b4 + cpfl(c4) / d4);
	printf("float result = %f \n\n", e4);

	return 0;
}
